UWARG/efs-zeropilot-4.0/stm32h753iitx/boardfiles/model/src/drivers.cpp
#include "drivers.hpp"
#include "museq.hpp"
#include "stm32h7xx_hal.h"
#include "zp_params.hpp"

#define MOT_TYPE_PWM 0
#define MOT_TYPE_DSHOT 5

// External hardware handles
extern IWDG_HandleTypeDef hiwdg1;
extern TIM_HandleTypeDef htim1;
extern TIM_HandleTypeDef htim2;
extern TIM_HandleTypeDef htim3;
extern UART_HandleTypeDef huart1;
extern UART_HandleTypeDef huart2;
extern UART_HandleTypeDef huart3;
extern UART_HandleTypeDef huart4;
extern UART_HandleTypeDef huart6;
extern SPI_HandleTypeDef hspi1;
extern SPI_HandleTypeDef hspi2;
extern SPI_HandleTypeDef hspi4;
extern I2C_HandleTypeDef hi2c1;
extern I2C_HandleTypeDef hi2c2;
extern I2C_HandleTypeDef hi2c3;
extern FDCAN_HandleTypeDef hfdcan1;

// ----------------------------------------------------------------------------
// Global handles
// ----------------------------------------------------------------------------
SystemUtils *systemUtilsHandle = nullptr;
MathUtils *mathUtilsHandle = nullptr;
FFT *fftHandle = nullptr;
IndependentWatchdog *iwdgHandle = nullptr;
SDFileSystem *sdFileSystemHandle = nullptr;

IMotorControl *motorHandles[8] = {0};

CANController *canControllerHandle = nullptr;
SafetySwitch *safetySwitchHandle = nullptr;
GPS *gps1Handle = nullptr;
GPS *gps2Handle = nullptr;
CRSFReceiver *rcHandle = nullptr;
RFD *telemLinkHandle = nullptr;
FusedIMU *imuHandle = nullptr;
PowerModule *pmHandle = nullptr;
Rangefinder *rangefinderHandle = nullptr;
Barometer *barometerHandle = nullptr;

MessageQueue<RCMotorControlMessage_t> *amRCQueueHandle = nullptr;
MessageQueue<TMMessage_t> *tmQueueHandle = nullptr;
MessageQueue<mavlink_message_t> *messageBufferHandle = nullptr;

MessageQueue<SdReqMsg> *sdRequestQueueHandle = nullptr;
MessageQueue<SdReqBuf> *sdBufferQueueHandle = nullptr;
IMessageQueue<PollResult> *sdResponseQueuesHandle[static_cast<size_t>(ManagerId_e::NUM_MANAGERS)] = {nullptr};

// ----------------------------------------------------------------------------
// Motor instances & group
// ----------------------------------------------------------------------------
MotorInstance_t motorInstances[8];
MotorGroupInstance_t mainMotorGroup;

typedef struct
{
    TIM_HandleTypeDef *timer;
    uint32_t channel;
} motorChannel_t;

const motorChannel_t MOTOR_MAP[8] = {
    {&htim1, TIM_CHANNEL_1},
    {&htim1, TIM_CHANNEL_2},
    {&htim1, TIM_CHANNEL_3},
    {&htim1, TIM_CHANNEL_4},
    {&htim2, TIM_CHANNEL_1},
    {&htim2, TIM_CHANNEL_2},
    {&htim2, TIM_CHANNEL_3},
    {&htim2, TIM_CHANNEL_4},
};

const ZP_PARAM_ID SERVO_FUNC[8] = {
    ZP_PARAM_ID::SERVO1_FUNCTION,
    ZP_PARAM_ID::SERVO2_FUNCTION,
    ZP_PARAM_ID::SERVO3_FUNCTION,
    ZP_PARAM_ID::SERVO4_FUNCTION,
    ZP_PARAM_ID::SERVO5_FUNCTION,
    ZP_PARAM_ID::SERVO6_FUNCTION,
    ZP_PARAM_ID::SERVO7_FUNCTION,
    ZP_PARAM_ID::SERVO8_FUNCTION,
};

// ----------------------------------------------------------------------------
// Initialization
// ----------------------------------------------------------------------------
void initDrivers() {
    // Core utilities
    systemUtilsHandle = new SystemUtils();
    mathUtilsHandle = new MathUtils();
    fftHandle = new FFT();
    iwdgHandle = new IndependentWatchdog(&hiwdg1);

    // Motors (servo index matches SERVOx param)
    uint32_t servoType = int(ZP_PARAM::get(ZP_PARAM_ID::MOT_PWM_TYPE));
    for (int i = 0; i < 8; i++) {
        // Determine if it is brushless DC motor
        bool isBLDC = false; 
        #ifdef PLANE
        isBLDC = int(ZP_PARAM::get(SERVO_FUNC[i])) == int(MotorFunction_e::THROTTLE);
        #endif
        #ifdef QUADCOPTER
        isBLDC = int(ZP_PARAM::get(SERVO_FUNC[i])) == int(MotorFunction_e::MOTOR_1) || int(ZP_PARAM::get(SERVO_FUNC[i])) == int(MotorFunction_e::MOTOR_2) || int(ZP_PARAM::get(SERVO_FUNC[i])) == int(MotorFunction_e::MOTOR_3) || int(ZP_PARAM::get(SERVO_FUNC[i])) == int(MotorFunction_e::MOTOR_4);
        #endif
        if (isBLDC) {
            switch (servoType) {
            case MOT_TYPE_DSHOT: // DShot
                motorHandles[i] = new DshotMotorControl(MOTOR_MAP[i].timer, MOTOR_MAP[i].channel, false);
                break;
            case MOT_TYPE_PWM: // PWM
            default:
                motorHandles[i] = new MotorControl(MOTOR_MAP[i].timer, MOTOR_MAP[i].channel, 5, 10, i + 1);
                break;
            }
        }
        else {
            motorHandles[i] = new MotorControl(MOTOR_MAP[i].timer, MOTOR_MAP[i].channel, 5, 10, i + 1);
        }
    }

    // Peripherals
    safetySwitchHandle = new SafetySwitch(GPIOH, GPIO_PIN_12, GPIOH, GPIO_PIN_11);    
    gps1Handle = new GPS(&huart6);
    gps2Handle = new GPS(&huart3);
    rcHandle = new CRSFReceiver(&huart4);
    telemLinkHandle = new RFD(&huart1);
    IMU *imu0 = new IMU(&hspi1, GPIOC, GPIO_PIN_4, 0, IMU_ODR_1KHZ);
    IMU *imu1 = new IMU(&hspi1, GPIOC, GPIO_PIN_5, 1, IMU_ODR_1KHZ);
    imuHandle = new FusedIMU(&hspi1, imu0, imu1);
    pmHandle = new PowerModule(&hi2c1);
    if (ZP_PARAM::get(ZP_PARAM_ID::RNGFND_ENABLE) == 1) {
        rangefinderHandle = new Rangefinder(&hi2c3);
    }
    barometerHandle = new Barometer(&hi2c2);

    // Queues
    amRCQueueHandle = new MessageQueue<RCMotorControlMessage_t>(&amQueueId);
    tmQueueHandle = new MessageQueue<TMMessage_t>(&tmQueueId);
    messageBufferHandle = new MessageQueue<mavlink_message_t>(&messageBufferId);
    sdRequestQueueHandle = new MessageQueue<SdReqMsg>(&sdRequestQueueId);
    sdBufferQueueHandle = new MessageQueue<SdReqBuf>(&sdBufferQueueId);
    for (int i = 0; i < static_cast<int>(ManagerId_e::NUM_MANAGERS); ++i) {
        sdResponseQueuesHandle[i] = new MessageQueue<PollResult>(&sdResponseQueueId[i]);
    }

    // File system
    sdFileSystemHandle = new SDFileSystem(sdRequestQueueHandle, sdBufferQueueHandle, sdResponseQueuesHandle);

    // Initialize hardware components
    for (int i = 0; i < 8; i++) {
        motorHandles[i]->init();
    }
    MotorControl::enableServo(GPIOF, GPIO_PIN_1);
    MotorControl::enableServoSwitch(GPIOE, GPIO_PIN_3, &hspi4);

    canControllerHandle = new CANController(&hfdcan1, systemUtilsHandle);

    rcHandle->init();
    gps1Handle->init();
    gps2Handle->init();
    imuHandle->init();
    telemLinkHandle->init();
    pmHandle->init();
    if (rangefinderHandle != nullptr) {
        rangefinderHandle->init();
    }
    barometerHandle->init();
    sdFileSystemHandle->init();

    // Motor instances — fields loaded from ZP_PARAM by AttitudeManager::loadServoParams()
    for (int i = 0; i < 8; i++) {
        motorInstances[i] = {motorHandles[i]};
    }

    mainMotorGroup = {motorInstances, 8};
}
